using App.Utils;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;


/// <summary>
/// 用户-角色-权限 三级授权机制
/// 权限
///     系统只根据权限来限制操作，如修改按钮是否可用，删除按钮是否可用等
///     编写页面时无需考虑角色
///     权限是可以预料且内置的，如产品查看、产品修改、产品新建、产品删除权限
///     既然是固定的，可以用枚举来描述，也便于强类型编码，避免编码变更导致权限错乱的情况
///     提示：初期也可以简化权限，如系统管理、产品管理；在后期再根据需求拆分为产品新建、产品修改等。
///     
/// 角色
///     角色是权限的集合
///     角色和权限的关系可在后台进行配置
///     角色可以动态增减，可在后台进行配置
///     
/// 用户
///     拥有多个角色
///     系统可根据用户拥有的角色对应的权限列表，来进行授权操作
///     注意：不推荐直接根据角色来授权，会导致逻辑不清晰
/// </summary>
namespace App.DAL
{
    /// <summary>
    /// 权限清单（权限是程序内定的，作为枚举进行存储很合适)
    /// </summary>
    public enum Powers : int
    {
        //---------------------------------------------
        // AppPlat 通用权限（000-099）
        //---------------------------------------------
        // 基础框架权限
        [UI("Core", "访问后台")]        Backend = -1,


        //---------------------------------------------
        // 管理相关
        //---------------------------------------------
        [UI("Admin", "Admin专用")]        Admin = 0,                   // Admin专用权限，根据需求再细分
        [UI("Admin", "监管")]             AdminMonitor = -3,           
        //[UI("Admin", "开发")]           AdminDevelop = -4,           
        //[UI("Admin", "配置")]           AdminConfig = -5,            


        //---------------------------------------------
        // 开发
        //---------------------------------------------
        [UI("开发", "接口调测")]         API = 10,
        [UI("开发", "测试员")]              Test = 11,              

        //---------------------------------------------
        // 配置
        //---------------------------------------------
        [UI("配置", "站点配置")]            ConfigSite = 20,
        [UI("配置", "角色权限管理")]        RolePowerEdit = 21,
        [UI("配置", "菜单管理")]            Menu = 22,
        [UI("配置", "客户端管理")]          Client = 23,
        [UI("配置", "序列号维护")]          Sequence = 24,


        //---------------------------------------------
        // 监管
        //---------------------------------------------
        [UI("监管", "监管")]                Monitor = 30,
        [UI("监管", "日志管理")]            Log = 31,
        [UI("监管", "在线用户管理")]        Online = 32,
        [UI("监管", "消息管理")]            Message = 33,
        [UI("监管", "资源管理")]            Res = 34,
        [UI("监管", "IP黑名单维护")]        IPFilter = 35,

        //static Power Monitor = Get("Monitor");


        //---------------------------------------------
        // 运维（网站配置、日志、性能、监控等）
        //---------------------------------------------
        [UI("反馈", "新增")]                FeedBackNew = 40,
        [UI("反馈", "查看")]                FeedBackView = 41,
        [UI("反馈", "修改")]                FeedBackEdit = 42,
        [UI("反馈", "删除")]                FeedBackDelete = 43,
                                           
        [UI("反馈", "派发")]                FeedBackDispatch = 45,           
        [UI("反馈", "处理")]                FeedBackHandle = 46,           



        //---------------------------------------------
        // 用户相关
        //---------------------------------------------
        [UI("用户", "用户新增")]            UserNew = 50,
        [UI("用户", "用户浏览")]            UserView = 51,
        [UI("用户", "用户修改")]            UserEdit = 52,
        [UI("用户", "用户删除")]            UserDelete = 53,
        [UI("用户", "帮用户修改密码")]      UserChangePassword = 54,


        //---------------------------------------------
        // 基础数据
        //---------------------------------------------
        [UI("基础数据", "部门新增")]        DeptNew = 60,
        [UI("基础数据", "部门查看")]        DeptView = 61,
        [UI("基础数据", "部门修改")]        DeptEdit = 62,
        [UI("基础数据", "部门删除")]        DeptDelete = 63,
                      
        [UI("基础数据", "职务新增")]        TitleNew = 70,
        [UI("基础数据", "职务查看")]        TitleView = 71,
        [UI("基础数据", "职务修改")]        TitleEdit = 72,
        [UI("基础数据", "职务删除")]        TitleDelete = 73,
                      
        [UI("基础数据", "区域新增")]        AreaNew = 80,
        [UI("基础数据", "区域查看")]        AreaView = 81,
        [UI("基础数据", "区域修改")]        AreaEdit = 82,
        [UI("基础数据", "区域删除")]        AreaDelete = 83,

                              
        [UI("基础数据", "组织新增")]        OrgNew = 90,
        [UI("基础数据", "组织查看")]        OrgView = 91,
        [UI("基础数据", "组织修改")]        OrgEdit = 92,
        [UI("基础数据", "组织删除")]        OrgDelete = 93,



        //---------------------------------------------
        // 文档（100-109）
        //---------------------------------------------                  
        [UI("文档", "新增")]               ArticleNew = 100,
        [UI("文档", "查看")]               ArticleView = 101,
        [UI("文档", "修改")]               ArticleEdit = 102,
        [UI("文档", "删除")]               ArticleDelete = 103,
        [UI("文档", "目录查看")]           ArticleDirView = 104,
        [UI("文档", "目录管理")]           ArticleDirEdit = 105,
        [UI("文档", "访问管理")]           ArticleVisitEdit = 106,
        [UI("文档", "反馈管理")]           ArticleFeedbackEdit = 107,
        [UI("文档", "角色目录管理")]       ArticleDirRoleEdit = 110,
        [UI("文档", "配置")]               ArticleConfig = 111,


        //---------------------------------------------
        // 社交
        //---------------------------------------------                  
        [UI("社交", "签到新增")]        SignNew = 130,
        [UI("社交", "签到查看")]        SignView = 131,
        [UI("社交", "签到修改")]        SignEdit = 132,
        [UI("社交", "签到删除")]        SignDelete = 133,
                  
        [UI("社交", "邀请新增")]        InviteNew = 140,
        [UI("社交", "邀请查看")]        InviteView = 141,
        [UI("社交", "邀请修改")]        InviteEdit = 142,
        [UI("社交", "邀请删除")]        InviteDelete = 143,
                  
        [UI("社交", "关注新增")]        FavoriteNew = 150,
        [UI("社交", "关注查看")]        FavoriteView = 151,
        [UI("社交", "关注修改")]        FavoriteEdit = 152,
        [UI("社交", "关注删除")]        FavoriteDelete = 153,


        //---------------------------------------------
        // 商城
        //---------------------------------------------
        [UI("商城", "商店管理")]        AdminShop = 180,
        [UI("商城", "维修商管理")]      AdminRepairShop = 181,

        [UI("商城", "广告新增")]        AdvertNew = 190,
        [UI("商城", "广告查看")]        AdvertView = 191,
        [UI("商城", "广告修改")]        AdvertEdit = 192,
        [UI("商城", "广告删除")]        AdvertDelete = 193,

        [UI("商城", "商店新增")]        ShopNew = 200,
        [UI("商城", "商店查看")]        ShopView = 201,
        [UI("商城", "商店修改")]        ShopEdit = 202,
        [UI("商城", "商店删除")]        ShopDelete = 203,

        [UI("商店", "产品新增")]        ProductNew = 210,
        [UI("商店", "产品查看")]        ProductView = 211,
        [UI("商店", "产品修改")]        ProductEdit = 212,
        [UI("商店", "产品删除")]        ProductDelete = 213,

        [UI("商店", "订单新增")]        OrderNew = 220,
        [UI("商店", "订单查看")]        OrderView = 221,
        [UI("商店", "订单修改")]        OrderEdit = 222,
        [UI("商店", "订单删除")]        OrderDelete = 223,
        [UI("商店", "订单价格修改")]    OrderEditPrice = 224,

        [UI("商店", "资产新增")]        AssetNew = 230,
        [UI("商店", "资产查看")]        AssetView = 231,
        [UI("商店", "资产修改")]        AssetEdit = 232,
        [UI("商店", "资产删除")]        AssetDelete = 233,

        [UI("商店", "财务新增")]        FinanceNew = 240,
        [UI("商店", "财务查看")]        FinanceView = 241,
        [UI("商店", "财务修改")]        FinanceEdit = 242,
        [UI("商店", "财务删除")]        FinanceDelete = 243,

        [UI("商店", "积分新增")]        ScoreNew = 250,
        [UI("商店", "积分查看")]        ScoreView = 251,
        [UI("商店", "积分修改")]        ScoreEdit = 252,
        [UI("商店", "积分删除")]        ScoreDelete = 253,

        [UI("商店", "评分新增")]        RateNew = 260,
        [UI("商店", "评分查看")]        RateView = 261,
        [UI("商店", "评分修改")]        RateEdit = 262,
        [UI("商店", "评分删除")]        RateDelete = 263,


        //---------------------------------------------
        // 微信相关维护
        //---------------------------------------------
        [UI("微信", "微信管理")]           Wechat = 400,           // 微信管理大权限，根据需要再细分
        [UI("微信", "微信公众号菜单维护")] WechatMenuEdit = 401,
        [UI("微信", "微信公众号标签维护")] WechatTagEdit = 402,
        [UI("微信", "微信公众号文章维护")] WechatArticleEdit = 403,



        //---------------------------------------------
        // 报表相关权限（900-999）
        //---------------------------------------------
        // 报表
        [UI("报表", "报表")]            Report = 900,      // 报表管理大权限，根据需要再细分
        [UI("报表", "报表新增")]        ReportNew = 901,
        [UI("报表", "报表查看")]        ReportView = 902,
        [UI("报表", "报表管理")]        ReportEdit = 903,
        [UI("报表", "报表删除")]        ReportDelete = 904,



        [UI("积分", "积分查看")] UserScoreView = 1000,
    }

}